In [35]:
import pandas as pd

In [36]:
data = pd.read_csv(r'amazon.xls', encoding='latin1')

In [37]:
data

      year      state     month  number        date
0     1998       Acre   Janeiro     0.0  1998-01-01
1     1999       Acre   Janeiro     0.0  1999-01-01
2     2000       Acre   Janeiro     0.0  2000-01-01
3     2001       Acre   Janeiro     0.0  2001-01-01
4     2002       Acre   Janeiro     0.0  2002-01-01
...    ...        ...       ...     ...         ...
6449  2012  Tocantins  Dezembro   128.0  2012-01-01
6450  2013  Tocantins  Dezembro    85.0  2013-01-01
6451  2014  Tocantins  Dezembro   223.0  2014-01-01
6452  2015  Tocantins  Dezembro   373.0  2015-01-01
6453  2016  Tocantins  Dezembro   119.0  2016-01-01

[6454 rows x 5 columns]

In [38]:
data.isna().sum()

year      0
state     0
month     0
number    0
date      0
dtype: int64

In [39]:
# data dimension check
data.shape

(6454, 5)

In [40]:
data.head()

   year state    month  number        date
0  1998  Acre  Janeiro     0.0  1998-01-01
1  1999  Acre  Janeiro     0.0  1999-01-01
2  2000  Acre  Janeiro     0.0  2000-01-01
3  2001  Acre  Janeiro     0.0  2001-01-01
4  2002  Acre  Janeiro     0.0  2002-01-01

In [41]:
data.sample()

      year state     month  number        date
4224  1998  Piau  Setembro   1.991  1998-01-01

In [42]:
data.dtypes

year        int64
state      object
month      object
number    float64
date       object
dtype: object

In [43]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    6454 non-null   int64
 1   state   6454 non-null   object
 2   month   6454 non-null   object
 3   number  6454 non-null   float64
 4   date    6454 non-null   object
dtypes: float64(1), int64(1), object(3)
memory usage: 252.2+ KB

In [44]:
data.isnull().sum()

year      0
state     0
month     0
number    0
date      0
dtype: int64

In [45]:
#percentage of null values
data.isnull().sum()/data.shape[0]*100

year      0.0
state     0.0
month     0.0
number    0.0
date      0.0
dtype: float64

In [46]:
data.describe()

              year       number
count  6454.000000  6454.000000
mean   2007.461729   108.293163
std       5.746654   190.812242
min    1998.000000     0.000000
25%    2002.000000     3.000000
50%    2007.000000    24.000000
75%    2012.000000   113.000000
max    2017.000000   998.000000

In [47]:
data.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
year,6454.0,2007.461729,5.746654,1998.0,2002.0,2007.0,2012.0,2017.0
number,6454.0,108.293163,190.812242,0.0,3.0,24.0,113.0,998.0

In [48]:
data.duplicated().sum()

32

In [49]:
data.corr

<bound method DataFrame.corr of       year      state     month  number        date
0     1998       Acre   Janeiro     0.0  1998-01-01
1     1999       Acre   Janeiro     0.0  1999-01-01
2     2000       Acre   Janeiro     0.0  2000-01-01
3     2001       Acre   Janeiro     0.0  2001-01-01
4     2002       Acre   Janeiro     0.0  2002-01-01
...    ...        ...       ...     ...         ...
6449  2012  Tocantins  Dezembro   128.0  2012-01-01
6450  2013  Tocantins  Dezembro    85.0  2013-01-01
6451  2014  Tocantins  Dezembro   223.0  2014-01-01
6452  2015  Tocantins  Dezembro   373.0  2015-01-01
6453  2016  Tocantins  Dezembro   119.0  2016-01-01

[6454 rows x 5 columns]>

In [50]:
data.nunique()

year        20
state       23
month       12
number    1479
date        20
dtype: int64

In [58]:
data.sample(10)

      year           state      month   number        date
1773  2017  Espirito Santo       Maio   10.000  2017-01-01
3847  2000      Pernambuco  Fevereiro    4.000  2000-01-01
5121  1999        Rondonia      Junho   10.000  1999-01-01
5893  2014       Sao Paulo     Agosto    1.458  2014-01-01
2120  2005           Goias   Novembro  144.000  2005-01-01
4710  2006             Rio   Setembro   50.000  2006-01-01
5899  2000       Sao Paulo   Setembro  582.000  2000-01-01
3977  2010      Pernambuco     Agosto   29.000  2010-01-01
4379  2014             Rio      Abril   25.000  2014-01-01
39    2017            Acre  Fevereiro    1.000  2017-01-01

In [60]:
data['month'].unique()

array(['Janeiro', 'Fevereiro', 'MarÃ§o', 'Abril', 'Maio', 'Junho', 'Julho',
       'Agosto', 'Setembro', 'Outubro', 'Novembro', 'Dezembro'],
      dtype=object)

In [61]:
data['month'] = data['month'].map({'Janeiro':'Jan', 'Fevereiro':'Feb', 'MarÃ§o':'Mar', 'Abril':'Apr', 'Maio':'May', 'Junho':'Jun', 'Julho':'Jul', 'Agosto':'Aug', 'Setembro':'Sep', 'Outubro':'Oct', 'Novembro':'Nov', 'Dezembro':'Dec'})

In [62]:
data.sample(10)

      year        state month  number        date
4123  2017         Piau   Mar   25.00  2017-01-01
2818  2006  Mato Grosso   Oct  244.00  2006-01-01
215   2013         Acre   Nov   79.00  2013-01-01
2834  2002  Mato Grosso   Nov    1.47  2002-01-01
1303  2005        Ceara   Jun    6.00  2005-01-01
5901  2002    Sao Paulo   Sep  302.00  2002-01-01
4699  2015          Rio   Aug   16.00  2015-01-01
4921  1998          Rio   Aug    9.00  1998-01-01
2164  2010     Maranhao   Jan  319.00  2010-01-01
251   2010      Alagoas   Jan   23.00  2010-01-01

In [ ]:
#outliers
#smote
#normalization
#- model implementation
#label encoder
#hypothesis
#sql

In [65]:
# Which state has maximum number of forest fires reported
data.groupby('state')['number'].sum().sort_values(ascending=False)

state
Mato Grosso         96246.028
Paraiba             52435.918
Sao Paulo           51121.198
Rio                 45160.865
Bahia               44746.226
Piau                37803.747
Goias               37695.520
Minas Gerais        37475.258
Tocantins           33707.885
Amazonas            30650.129
Ceara               30428.063
Maranhao            25129.131
ParÃ¡                24512.144
Pernambuco          24498.000
Roraima             24385.074
Santa Catarina      24359.852
Amapa               21831.576
Rondonia            20285.429
Acre                18464.030
Espirito Santo       6546.000
Alagoas              4644.000
Distrito Federal     3561.000
Sergipe              3237.000
Name: number, dtype: float64

In [67]:
data.groupby('state')['number'].max().sort_values(ascending=False)

state
Amazonas            998.0
Bahia               995.0
Ceara               995.0
Tocantins           989.0
Paraiba             987.0
ParÃ¡                982.0
Sao Paulo           981.0
Mato Grosso         979.0
Maranhao            972.0
Amapa               969.0
Rondonia            969.0
Acre                960.0
Minas Gerais        959.0
Goias               943.0
Piau                943.0
Rio                 885.0
Pernambuco          859.0
Roraima             820.0
Santa Catarina      765.0
Espirito Santo      307.0
Sergipe             198.0
Distrito Federal    196.0
Alagoas             162.0
Name: number, dtype: float64

In [69]:
#Display the number of fires reported in amazons year wise
data.groupby('year')['number'].max().reset_index()

    year  number
0   1998   875.0
1   1999   982.0
2   2000   925.0
3   2001   979.0
4   2002   976.0
5   2003   977.0
6   2004   960.0
7   2005   948.0
8   2006   995.0
9   2007   982.0
10  2008   998.0
11  2009   989.0
12  2010   941.0
13  2011   974.0
14  2012   995.0
15  2013   956.0
16  2014   952.0
17  2015   960.0
18  2016   969.0
19  2017   987.0